# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer
#+STARTUP: overview
#+STARTUP: indent
#+TAGS: noexport(n)
#+LANGUAGE: en

#+Title: Porting and optimizing Alya kernels using BOAST
#+AUTHOR:      Steven QUINITO MASNADA

#+EPRESENT_FRAME_LEVEL: 2

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [11pt,xcolor=dvipsnames,presentation]
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t

#+LATEX_HEADER: \usedescriptionitemofwidthas{bl}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[american]{babel}
#+LATEX_HEADER: \usepackage{ifthen,figlatex,amsmath,amstext,gensymb,amssymb}
#+LATEX_HEADER: \usepackage{boxedminipage,xspace,multicol}
#+LATEX_HEADER: %%%%%%%%% Begin of Beamer Layout %%%%%%%%%%%%%
#+LATEX_HEADER: \ProcessOptionsBeamer
#+latex_header: \mode<beamer>{\usetheme{Madrid}}
#+LATEX_HEADER: \usecolortheme{whale}
#+LATEX_HEADER: \usecolortheme[named=BrickRed]{structure}
# #+LATEX_HEADER: \useinnertheme{rounded}
#+LATEX_HEADER: \useoutertheme{infolines}
#+LATEX_HEADER: \setbeamertemplate{footline}[frame number]
#+LATEX_HEADER: \setbeamertemplate{headline}[default]
#+LATEX_HEADER: \setbeamertemplate{navigation symbols}{}
#+LATEX_HEADER: \defbeamertemplate*{headline}{info theme}{}
#+LATEX_HEADER: \defbeamertemplate*{footline}{info theme}{\leavevmode%
#+LATEX_HEADER:   \hbox{%
#+LATEX_HEADER:     \begin{beamercolorbox}[wd=.5\paperwidth,ht=2.25ex,dp=1ex,center]{author in head/foot}%
#+LATEX_HEADER:       \usebeamerfont{author in head/foot}\insertshortauthor
#+LATEX_HEADER:     \end{beamercolorbox}%
#+LATEX_HEADER:   \begin{beamercolorbox}[wd=.41\paperwidth,ht=2.25ex,dp=1ex,center]{title in head/foot}%
#+LATEX_HEADER:     \usebeamerfont{title in head/foot}\insertsectionhead
#+LATEX_HEADER:   \end{beamercolorbox}%
#+LATEX_HEADER:   \begin{beamercolorbox}[wd=.09\paperwidth,ht=2.25ex,dp=1ex,right]{section in head/foot}%
**** Intrinsic speedup
         #+begin_src R :results output :session :exports both
           library(ggplot2)
           library(plyr)
           
           df = read.csv('../../../experiments/2016_11_14/titan/15_18_23/Data.csv',strip.white=T,header=T)
           boast <- data.frame( nest = df[df$kernel == "boast",]$nest, acc = df[df$kernel == "ref",]$time / df[df$kernel == "boast",]$time )
           df2 <- ddply(boast, c("nest"), summarise, speedup = mean(acc), err = 2*sd(acc)/sqrt(length(acc)))
           summary(df2)
         #+end_src

         #+RESULTS:
         :       nest          speedup           err          
         :  Min.   :1.000   Min.   :1.502   Min.   :0.009819  
         :  1st Qu.:2.750   1st Qu.:1.859   1st Qu.:0.015442  
         :  Median :4.500   Median :2.133   Median :0.023402  
         :  Mean   :4.625   Mean   :2.121   Mean   :0.029015  
         :  3rd Qu.:6.250   3rd Qu.:2.317   3rd Qu.:0.031896  
         :  Max.   :9.000   Max.   :2.817   Max.   :0.074835

         #+begin_src R :results output graphics :file ./img/plots/speedup.pdf :exports both :width 8 :height 6 :session
           ggplot(df2, aes(x = factor(nest), y = speedup)) + 
               geom_bar(fill="dodgerblue3",stat = "identity", position="dodge") +
               geom_errorbar(aes(ymax = speedup + err, ymin = speedup - err), position = position_dodge(0.9), width = 0.5) +
               labs(title = "Speedup compared to the reference implementation on different loop nests", y="Speedup", x="Loop Nest") +
               theme(axis.text=element_text(size=14,color="black"), axis.title=element_text(size=14,face="bold"), plot.title = element_text(size=14,face="bold"))
         #+end_src

         #+RESULTS:
         [[file:./img/plots/speedup.pdf]]
**** Inline speedup
#+begin_src R :results output :session :exports both
  library(ggplot2)
  library(plyr)

  df <- read.csv("../../../experiments/2016_12_14/titan/17_17_45/Data.csv",strip.white=T,header=T)
  summary(df)

  df2 <- ddply(df,c("nest","usage"), summarize,
                 min_time = min(time), err = 2*sd(time)/sqrt(length(time)))
  call <- data.frame(usage = df2[df2$usage =="call",]$usage, nest=df2[df2$usage =="call",]$nest, speedup= df2[df2$usage == "included",]$min_time / df2[df2$usage == "call",]$min_time )
  inline <- data.frame(usage = df2[df2$usage =="inlined",]$usage, nest=df2[df2$usage =="inlined",]$nest, speedup= df2[df2$usage == "included",]$min_time / df2[df2$usage == "inlined",]$min_time )
  df_comp <- rbind(call,inline)

  df_comp$nest <- as.factor(df_comp$nest)
#+end_src

#+RESULTS:
#+begin_example
 vector_length preprocessor       nest     unroll           usage      
 Min.   :2     false:33000   Min.   : 1   true:33000   call    :11000  
 1st Qu.:2                   1st Qu.: 3                included:11000  
 Median :2                   Median : 6                inlined :11000  
 Mean   :2                   Mean   : 6                                
 3rd Qu.:2                   3rd Qu.: 9                                
 Max.   :2                   Max.   :11                                
 CFLAGS          pgaus       pnode        time          
 -O3:33000   Min.   :8   Min.   :8   Min.   :7.990e-07  
             1st Qu.:8   1st Qu.:8   1st Qu.:1.258e-06  
             Median :8   Median :8   Median :1.886e-06  
             Mean   :8   Mean   :8   Mean   :3.197e-06  
             3rd Qu.:8   3rd Qu.:8   3rd Qu.:3.707e-06  
             Max.   :8   Max.   :8   Max.   :4.767e-05
#+end_example

#+begin_src R :results output graphics :file ./img/plots/speedup_inline.pdf :exports both :width 8 :height 6 :session
  ggplot(df_comp) +         
      geom_bar(aes(y=speedup,x=nest, colour=usage,fill=usage), stat="identity", position="dodge")+
      geom_hline(yintercept=1,linetype=2)+
      labs(title = "Speedup of call and inline versions compared to included", y="Speedup", x="Loop Nest") +
      theme(axis.text=element_text(size=14,color="black"), axis.title=element_text(size=14,face="bold"), plot.title = element_text(size=14,face="bold"))
#+end_src

#+RESULTS:
[[file:./img/plots/speedup_inline.pdf]]

#+begin_src R :results output :session :exports both
summary(inline)
summary(call)
#+end_src

#+RESULTS:
#+begin_example
      usage         nest         speedup     
 call    : 0   Min.   : 1.0   Min.   :1.013  
 included: 0   1st Qu.: 3.5   1st Qu.:1.035  
 inlined :11   Median : 6.0   Median :1.063  
               Mean   : 6.0   Mean   :1.068  
               3rd Qu.: 8.5   3rd Qu.:1.095  
               Max.   :11.0   Max.   :1.129
      usage         nest         speedup      
 call    :11   Min.   : 1.0   Min.   :0.9979  
 included: 0   1st Qu.: 3.5   1st Qu.:1.0585  
 inlined : 0   Median : 6.0   Median :1.0819  
               Mean   : 6.0   Mean   :1.0800  
               3rd Qu.: 8.5   3rd Qu.:1.1071  
               Max.   :11.0   Max.   :1.1409
#+end_example

